In [1]:
import sqlite3

In [2]:
connection=sqlite3.connect('example.db')
connection

In [3]:
cursor=connection.cursor()

In [4]:
cursor.execute('''
Create Table If Not Exists Employees(
  id integer Primary Key,
  name text Not Null,
  age integer,
  department text,
  salary real
  )

''')
connection.commit()

In [5]:
cursor.execute('''
Select * from Employees
''')

In [6]:
cursor.execute('''
  Insert Into Employees(name,age,department,salary)
  Values('John Doe',30,'IT',50000)
''')
cursor.execute('''
  Insert Into Employees(name,age,department,salary)
  Values('MAhindra',50,'Automation',100000)
''')
cursor.execute('''
  Insert Into Employees(name,age,department,salary)
  Values('Simon Dull',40,'Finance',35000)
''')
cursor.execute('''
  Insert Into Employees(name,age,department,salary)
  Values('John',34,'sales',40000)
''')
connection.commit()

In [7]:
cursor.execute('Select * from Employees')
rows=cursor.fetchall()
for row in rows:
  print(row)

(1, 'John Doe', 30, 'IT', 50000.0)
(2, 'MAhindra', 50, 'Automation', 100000.0)
(3, 'Simon Dull', 40, 'Finance', 35000.0)
(4, 'John', 34, 'sales', 40000.0)

In [8]:
cursor.execute('''
  UPDATE Employees
  SET salary=60000
  WHERE name='John Doe'
''')
connection.commit()

In [9]:
cursor.execute('Select * from Employees')
rows=cursor.fetchall()
for row in rows:
  print(row)

(1, 'John Doe', 30, 'IT', 60000.0)
(2, 'MAhindra', 50, 'Automation', 100000.0)
(3, 'Simon Dull', 40, 'Finance', 35000.0)
(4, 'John', 34, 'sales', 40000.0)

In [11]:
cursor.execute('''
  Delete from Employees
  WHERE name='John Doe'
''')
connection.commit()

In [12]:
cursor.execute('Select * from Employees')
rows=cursor.fetchall()
for row in rows:
  print(row)

(2, 'MAhindra', 50, 'Automation', 100000.0)
(3, 'Simon Dull', 40, 'Finance', 35000.0)
(4, 'John', 34, 'sales', 40000.0)

In [43]:


connection = sqlite3.connect('Sales_data.db')
cursor = connection.cursor()

# Dropping the  existing table if it exists
cursor.execute('DROP TABLE IF EXISTS sales')

# Creating the table
cursor.execute('''
  CREATE TABLE sales (
    id INTEGER PRIMARY KEY,
    date TEXT NOT NULL,
    product TEXT,
    sales INTEGER,
    region TEXT
  )
''')


sales_data = [
    ('2025-01-01', 'ProductA', 100, 'North'),
    ('2025-01-02', 'ProductB', 500, 'South'),
    ('2025-01-03', 'ProductC', 250, 'East'),
    ('2025-01-04', 'ProductD', 200, 'West'),
    ('2026-01-05', 'ProductE', 150, 'North')
]

cursor.executemany('''
  INSERT INTO sales (date, product, sales, region)
  VALUES (?, ?, ?, ?)
''', sales_data)

connection.commit()

In [44]:
cursor.execute('Select * from sales')
rows=cursor.fetchall()
for row in rows:
  print(row)

(1, '2025-01-01', 'ProductA', 100, 'North')
(2, '2025-01-02', 'ProductB', 500, 'South')
(3, '2025-01-03', 'ProductC', 250, 'East')
(4, '2025-01-04', 'ProductD', 200, 'West')
(5, '2026-01-05', 'ProductE', 150, 'North')

In [45]:
  connection.close()# it  closes the database